// data/protection-civil-data.js

        const unitsData = [
            { name: "وحدة الحماية المدنية - الجزائر وسط", wilaya: "الجزائر", baladia: "الجزائر وسط", phone: "023 45 67 89", lat: 36.7762, lon: 3.0585 },
            { name: "وحدة الحماية المدنية - حسين داي", wilaya: "الجزائر", baladia: "حسين داي", phone: "023 67 89 10", lat: 36.7592, lon: 3.0922 },
            { name: "وحدة الحماية المدنية - الحراش", wilaya: "الجزائر", baladia: "الحراش", phone: "023 89 10 11", lat: 36.7241, lon: 3.1431 },
            { name: "وحدة الحماية المدنية - وهران", wilaya: "وهران", baladia: "وهران", phone: "041 34 56 78", lat: 35.6997, lon: -0.6419 },
            { name: "وحدة الحماية المدنية - قسنطينة", wilaya: "قسنطينة", baladia: "قسنطينة", phone: "031 45 67 89", lat: 36.365, lon: 6.6147 },
            { name: "وحدة الحماية المدنية - عنابة", wilaya: "عنابة", baladia: "عنابة", phone: "038 56 78 90", lat: 36.9023, lon: 7.7559 },
            { name: "المديرية العامة للحماية المدنية - سيدي امحمد", wilaya: "الجزائر", baladia: "سيدي امحمد", phone: "021 66 14 14", lat: 36.7558, lon: 3.0536 },
            { name: "وحدة الحماية المدنية - ميناء الجزائر", wilaya: "الجزائر", baladia: "الجزائر الوسطى", phone: "021 71 14 14", lat: 36.7694, lon: 3.0639 },
            { name: "وحدة الحماية المدنية - القبة", wilaya: "الجزائر", baladia: "القبة", phone: "021 28 33 33", lat: 36.7469, lon: 3.0764 },
            { name: "وحدة الحماية المدنية - باب الواد", wilaya: "الجزائر", baladia: "باب الواد", phone: "021 96 14 14", lat: 36.7950, lon: 3.0500 },
            { name: "وحدة الحماية المدنية - الدويرة", wilaya: "الجزائر", baladia: "الدويرة", phone: "023 32 17 55", lat: 36.6703, lon: 2.9492 },
            { name: "وحدة الحماية المدنية - الحراش", wilaya: "الجزائر", baladia: "الحراش", phone: "021 52 14 14", lat: 36.7233, lon: 3.1331 },
            { name: "وحدة الحماية المدنية - الدار البيضاء", wilaya: "الجزائر", baladia: "الدار البيضاء", phone: "021 50 91 91", lat: 36.7111, lon: 3.2114 },
            { name: "الوحدة الوطنية للتدريب والتدخل", wilaya: "الجزائر", baladia: "الدار البيضاء", phone: "023 81 16 41", lat: 36.7224, lon: 3.1999 },
            { name: "وحدة الحماية المدنية - زرالدة", wilaya: "الجزائر", baladia: "زرالدة", phone: "021 32 14 14", lat: 36.7114, lon: 2.8425 },
            { name: "وحدة الحماية المدنية - رويبة", wilaya: "الجزائر", baladia: "الرويبة", phone: "021 81 14 14", lat: 36.7333, lon: 3.2833 },
            { name: "وحدة الحماية المدنية - عين البنيان", wilaya: "الجزائر", baladia: "عين البنيان", phone: "021 30 14 14", lat: 36.8028, lon: 2.9219 },
            { name: "وحدة الحماية المدنية - بئر مراد رايس", wilaya: "الجزائر", baladia: "بئر مراد رايس", phone: "021 56 14 14", lat: 36.7311, lon: 3.0506 },
            { name: "وحدة الحماية المدنية - الشراقة", wilaya: "الجزائر", baladia: "الشراقة", phone: "021 36 14 14", lat: 36.7667, lon: 2.9333 },
            { name: "وحدة الحماية المدنية - سوريكال", wilaya: "الجزائر", baladia: "باب الزوار", phone: "023 90 90 28", lat: 36.7385, lon: 3.1854 },
            { name: "وحدة الحماية المدنية - الحاميز", wilaya: "الجزائر", baladia: "الدار البيضاء", phone: "14", lat: 36.7243, lon: 3.2002 },
            { name: "وحدة الحماية المدنية - سيدي موسى", wilaya: "الجزائر", baladia: "سيدي موسى", phone: "14", lat: 36.6101, lon: 3.0879 },
            { name: "وحدة الحماية المدنية - حيدرة", wilaya: "الجزائر", baladia: "حيدرة", phone: "021 54 83 83", lat: 36.7410, lon: 3.0333 }
            
        ];


// تصدير البيانات للاستخدام في الصفحات الأخرى
if (typeof module !== 'undefined' && module.exports) {
    module.exports = unitsData; // لـ Node.js
} else {
    // للاستخدام في المتصفح
    window.unitsData = unitsData;
}